rofiqcp/Praktikum-Sistem-Embedded/Modul-06-FreeRTOS-Task/praktikum/STM32/STM32_09_Task_Watchdog/src/main.c
/* =========================================================================
 * STM32_09_Task_Watchdog
 * =========================================================================
 * Deskripsi  : Implementasi IWDG (Independent Watchdog) dengan FreeRTOS
 *              Mendemonstrasikan cara menggunakan hardware watchdog
 *              dalam sistem multi-task untuk mendeteksi task yang hang.
 *
 * Konsep     : IWDG menggunakan oscillator LSI (~40kHz) yang independen
 *              dari system clock. Jika tidak di-refresh dalam timeout
 *              yang ditentukan, MCU akan di-reset secara hardware.
 *
 * Konfigurasi IWDG:
 *   LSI    = ~40 kHz
 *   Prescaler = /256 -> counter clock = 40000/256 ≈ 156.25 Hz
 *   Reload = 625 -> timeout ≈ 625/156.25 = 4 detik
 *
 * Task       : 1. WatchdogFeeder - Secara periodik me-refresh IWDG
 *              2. NormalWorker   - Task kerja normal
 *              3. ProblematicTask- Task yang sengaja hang setelah N siklus
 *              4. MonitorTask    - Memantau status dan feed count
 *
 * Target     : STM32F103C8 (Blue Pill) - Cortex-M3 @ 72MHz
 * Framework  : STM32Cube HAL + FreeRTOS
 * ========================================================================= */

/* -- Header Files -------------------------------------------------------- */
#if defined(STM32F103xB)
#include "stm32f1xx_hal.h"
#elif defined(STM32F401xC) || defined(STM32F411xE)
#include "stm32f4xx_hal.h"
#endif
#include "FreeRTOS.h"
#include "task.h"
#include "timers.h"

#include <stdio.h>
#include <string.h>
#include <stdarg.h>

/* Deklarasi xPortSysTickHandler untuk fix warning */
extern void xPortSysTickHandler(void);

/* -- Definisi Konstanta -------------------------------------------------- */
/* IWDG Configuration */
#define IWDG_PRESCALER          IWDG_PRESCALER_256
#define IWDG_RELOAD_VALUE       625     /* ~4 detik timeout */
#define IWDG_TIMEOUT_MS         4000    /* Estimasi timeout dalam ms */
#define IWDG_FEED_INTERVAL_MS   1000    /* Refresh setiap 1 detik */

/* Task priorities */
#define FEEDER_TASK_PRIORITY    4
#define WORKER_TASK_PRIORITY    2
#define PROBLEM_TASK_PRIORITY   2
#define MONITOR_TASK_PRIORITY   3

/* Task stack sizes (words) */
#define FEEDER_STACK_SIZE       192
#define WORKER_STACK_SIZE       256
#define PROBLEM_STACK_SIZE      256
#define MONITOR_STACK_SIZE      384

/* Jumlah siklus sebelum task problematic hang */
#define PROBLEM_HANG_AFTER      15      /* Hang setelah 15 siklus */
#define PROBLEM_TASK_DELAY_MS   1500

/* Jumlah siklus sebelum feeder berhenti (simulasi kegagalan) */
#define FEEDER_STOP_AFTER       30      /* Berhenti feed setelah 30 siklus */

/* LED dan Button */
#define LED_PORT                GPIOC
#define LED_PIN                 GPIO_PIN_13
#define BUTTON_PORT             GPIOA
#define BUTTON_PIN              GPIO_PIN_0

/* -- Handle Peripheral --------------------------------------------------- */
static UART_HandleTypeDef huart1;
static IWDG_HandleTypeDef hiwdg;

/* -- Handle Task --------------------------------------------------------- */
static TaskHandle_t xFeederTaskHandle   = NULL;
static TaskHandle_t xWorkerTaskHandle   = NULL;
static TaskHandle_t xProblemTaskHandle  = NULL;
static TaskHandle_t xMonitorTaskHandle  = NULL;

/* -- Variabel Global ----------------------------------------------------- */
static volatile uint32_t ulSystemTick       = 0;
static volatile uint32_t ulFeedCount        = 0;
static volatile uint32_t ulWorkerCounter    = 0;
static volatile uint32_t ulProblemCounter   = 0;
static volatile uint32_t ulMonitorCycle     = 0;

/* Status flags */
static volatile uint8_t  ucFeederActive     = 1;   /* 1=aktif, 0=berhenti */
static volatile uint8_t  ucProblemHanging   = 0;   /* 1=task hang */
static volatile uint8_t  ucIWDGResetDetected = 0;  /* 1=reset oleh IWDG */
static volatile uint32_t ulExpectedResetTick = 0;

/* Alasan reset */
typedef enum {
    RESET_POWER_ON    = 0,
    RESET_IWDG        = 1,
    RESET_SOFTWARE    = 2,
    RESET_PIN         = 3,
    RESET_UNKNOWN     = 4
} ResetReason_t;

static ResetReason_t eResetReason = RESET_UNKNOWN;

/* Statistik per-boot */
static volatile uint32_t ulBootCount = 0;    /* Disimpan di backup register */
static volatile uint32_t ulLastFeedTick = 0;

/* -- Static memory untuk Idle dan Timer task ----------------------------- */
static StaticTask_t xIdleTaskTCB;
static StackType_t  uxIdleTaskStack[configMINIMAL_STACK_SIZE];

static StaticTask_t xTimerTaskTCB;
static StackType_t  uxTimerTaskStack[configTIMER_TASK_STACK_DEPTH];

/* -- Prototipe Fungsi ---------------------------------------------------- */
static void SystemClock_Config(void);
static void GPIO_Init(void);
static void UART1_Init(void);
static void IWDG_Init(void);
static void Error_Handler(void);
static ResetReason_t eCheckResetReason(void);
static void vPrintResetInfo(ResetReason_t eReason);

static void vWatchdogFeederTask(void *pvParameters);
static void vNormalWorkerTask(void *pvParameters);
static void vProblematicTask(void *pvParameters);
static void vMonitorTask(void *pvParameters);

static void vPrintBanner(void);
static void vPrintIWDGConfig(void);
static void vPrintCountdown(uint32_t ulRemainingMs);

/* -- Implementasi _write untuk printf via UART --------------------------- */
int _write(int file, char *ptr, int len)
{
    HAL_UART_Transmit(&huart1, (uint8_t *)ptr, len, HAL_MAX_DELAY);
    return len;
}

/* =========================================================================
 * SysTick Handler
 * ========================================================================= */
void SysTick_Handler(void)
{
    HAL_IncTick();
    ulSystemTick++;

    if (xTaskGetSchedulerState() != taskSCHEDULER_NOT_STARTED)
    {
        xPortSysTickHandler();
    }
}

/* =========================================================================
 * Callback hooks
 * ========================================================================= */
void vApplicationMallocFailedHook(void)
{
    printf("[DATA] MALLOC_FAIL,tick=%lu\r\n", (unsigned long)ulSystemTick);
    for (;;)
    {
        HAL_GPIO_TogglePin(LED_PORT, LED_PIN);
        HAL_Delay(100);
    }
}

void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName)
{
    (void)xTask;
    printf("[DATA] STACK_OVERFLOW,task=%s,tick=%lu\r\n",
           pcTaskName, (unsigned long)ulSystemTick);
    for (;;)
    {
        HAL_GPIO_TogglePin(LED_PORT, LED_PIN);
        HAL_Delay(200);
    }
}

void vApplicationGetIdleTaskMemory(StaticTask_t **ppxIdleTaskTCBBuffer,
                                   StackType_t **ppxIdleTaskStackBuffer,
                                   uint32_t *pulIdleTaskStackSize)
{
    *ppxIdleTaskTCBBuffer   = &xIdleTaskTCB;
    *ppxIdleTaskStackBuffer = uxIdleTaskStack;
    *pulIdleTaskStackSize   = configMINIMAL_STACK_SIZE;
}

void vApplicationGetTimerTaskMemory(StaticTask_t **ppxTimerTaskTCBBuffer,
                                    StackType_t **ppxTimerTaskStackBuffer,
                                    uint32_t *pulTimerTaskStackSize)
{
    *ppxTimerTaskTCBBuffer   = &xTimerTaskTCB;
    *ppxTimerTaskStackBuffer = uxTimerTaskStack;
    *pulTimerTaskStackSize   = configTIMER_TASK_STACK_DEPTH;
}

/* =========================================================================
 * Konfigurasi System Clock multi-MCU (F1 & F4) dengan LSI untuk IWDG
 * ========================================================================= */
static void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

#if defined(STM32F103xB)
    /* STM32F1xx: HSE 8MHz -> PLL x9 = 72MHz, LSI ON */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE
                                     | RCC_OSCILLATORTYPE_LSI;
    RCC_OscInitStruct.HSEState       = RCC_HSE_ON;
    RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
    RCC_OscInitStruct.LSIState       = RCC_LSI_ON;
    RCC_OscInitStruct.PLL.PLLState   = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource  = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMUL     = RCC_PLL_MUL9;

    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        Error_Handler();
    }

    RCC_ClkInitStruct.ClockType      = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
                                     | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
    {
        Error_Handler();
    }

