rofiqcp/Praktikum-Sistem-Embedded/Modul-06-FreeRTOS-Task/praktikum/STM32/STM32_09_Task_Watchdog/src/main.c
#elif defined(STM32F401xC)
    /* STM32F401CC: HSE 25MHz -> PLL (M=25, N=336, P=4) = 84MHz, LSI ON */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE
                                     | RCC_OSCILLATORTYPE_LSI;
    RCC_OscInitStruct.HSEState       = RCC_HSE_ON;
    RCC_OscInitStruct.LSIState       = RCC_LSI_ON;
    RCC_OscInitStruct.PLL.PLLState   = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource  = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLM       = 25;
    RCC_OscInitStruct.PLL.PLLN       = 336;
    RCC_OscInitStruct.PLL.PLLP       = RCC_PLLP_DIV4;
    RCC_OscInitStruct.PLL.PLLQ       = 7;

    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        Error_Handler();
    }

    RCC_ClkInitStruct.ClockType      = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
                                     | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
    {
        Error_Handler();
    }

#elif defined(STM32F411xE)
    /* STM32F411CE: HSE 25MHz -> PLL (M=25, N=400, P=4) = 100MHz, LSI ON */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE
                                     | RCC_OSCILLATORTYPE_LSI;
    RCC_OscInitStruct.HSEState       = RCC_HSE_ON;
    RCC_OscInitStruct.LSIState       = RCC_LSI_ON;
    RCC_OscInitStruct.PLL.PLLState   = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource  = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLM       = 25;
    RCC_OscInitStruct.PLL.PLLN       = 400;
    RCC_OscInitStruct.PLL.PLLP       = RCC_PLLP_DIV4;
    RCC_OscInitStruct.PLL.PLLQ       = 9;

    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        Error_Handler();
    }

    RCC_ClkInitStruct.ClockType      = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
                                     | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_3) != HAL_OK)
    {
        Error_Handler();
    }

#endif
}

/* =========================================================================
 * Inisialisasi GPIO
 * ========================================================================= */
static void GPIO_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();

    /* LED PC13 */
    GPIO_InitStruct.Pin   = LED_PIN;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(LED_PORT, &GPIO_InitStruct);
    HAL_GPIO_WritePin(LED_PORT, LED_PIN, GPIO_PIN_SET); /* Mati */

    /* Button PA0 */
    GPIO_InitStruct.Pin  = BUTTON_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLDOWN;
    HAL_GPIO_Init(BUTTON_PORT, &GPIO_InitStruct);
}

/* =========================================================================
 * Inisialisasi UART1: PA9=TX, PA10=RX, 115200 8N1
 * ========================================================================= */
static void UART1_Init(void)
{
    __HAL_RCC_USART1_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();

    GPIO_InitTypeDef GPIO_InitStruct = {0};

    GPIO_InitStruct.Pin   = GPIO_PIN_9;
    GPIO_InitStruct.Mode  = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    GPIO_InitStruct.Pin  = GPIO_PIN_10;
#if defined(STM32F103xB)
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
#elif defined(STM32F401xC) || defined(STM32F411xE)
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
#endif
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    huart1.Instance          = USART1;
    huart1.Init.BaudRate     = 115200;
    huart1.Init.WordLength   = UART_WORDLENGTH_8B;
    huart1.Init.StopBits     = UART_STOPBITS_1;
    huart1.Init.Parity       = UART_PARITY_NONE;
    huart1.Init.Mode         = UART_MODE_TX_RX;
    huart1.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
    huart1.Init.OverSampling = UART_OVERSAMPLING_16;

    if (HAL_UART_Init(&huart1) != HAL_OK)
    {
        Error_Handler();
    }
}

/* =========================================================================
 * Inisialisasi IWDG (Independent Watchdog)
 * LSI ~40kHz, Prescaler /256, Reload 625 -> Timeout ~4 detik
 * ========================================================================= */
static void IWDG_Init(void)
{
    hiwdg.Instance       = IWDG;
    hiwdg.Init.Prescaler = IWDG_PRESCALER;
    hiwdg.Init.Reload    = IWDG_RELOAD_VALUE;

    if (HAL_IWDG_Init(&hiwdg) != HAL_OK)
    {
        printf("[ERROR] Gagal menginisialisasi IWDG!\r\n");
        Error_Handler();
    }

    printf("[IWDG] Watchdog berhasil diinisialisasi\r\n");
}

/* =========================================================================
 * Cek alasan reset terakhir
 * Membaca flag di register RCC
 * ========================================================================= */
static ResetReason_t eCheckResetReason(void)
{
    ResetReason_t eReason = RESET_UNKNOWN;

    if (__HAL_RCC_GET_FLAG(RCC_FLAG_IWDGRST))
    {
        eReason = RESET_IWDG;
    }
    else if (__HAL_RCC_GET_FLAG(RCC_FLAG_SFTRST))
    {
        eReason = RESET_SOFTWARE;
    }
    else if (__HAL_RCC_GET_FLAG(RCC_FLAG_PINRST))
    {
        eReason = RESET_PIN;
    }
    else if (__HAL_RCC_GET_FLAG(RCC_FLAG_PORRST))
    {
        eReason = RESET_POWER_ON;
    }

    /* Bersihkan semua flag reset */
    __HAL_RCC_CLEAR_RESET_FLAGS();

    return eReason;
}

/* =========================================================================
 * Cetak informasi reset
 * ========================================================================= */
static void vPrintResetInfo(ResetReason_t eReason)
{
    printf("\r\n");
    printf("=========================================================\r\n");
    printf(" INFORMASI RESET\r\n");
    printf("=========================================================\r\n");

    switch (eReason)
    {
        case RESET_POWER_ON:
            printf(" Alasan: POWER-ON RESET (boot pertama)\r\n");
            printf("[DATA] RESET_REASON,type=POWER_ON\r\n");
            break;

        case RESET_IWDG:
            printf(" Alasan: IWDG WATCHDOG RESET!\r\n");
            printf(" >>> Watchdog tidak di-refresh tepat waktu! <<<\r\n");
            printf(" >>> Sistem di-reset otomatis oleh hardware <<<\r\n");
            printf("[DATA] RESET_REASON,type=IWDG_WATCHDOG\r\n");
            ucIWDGResetDetected = 1;
            break;

        case RESET_SOFTWARE:
            printf(" Alasan: SOFTWARE RESET\r\n");
            printf("[DATA] RESET_REASON,type=SOFTWARE\r\n");
            break;

        case RESET_PIN:
            printf(" Alasan: PIN RESET (tombol reset ditekan)\r\n");
            printf("[DATA] RESET_REASON,type=PIN\r\n");
            break;

        default:
            printf(" Alasan: TIDAK DIKETAHUI\r\n");
            printf("[DATA] RESET_REASON,type=UNKNOWN\r\n");
            break;
    }

    printf("=========================================================\r\n");
    printf("\r\n");
}

/* =========================================================================
 * Error Handler
 * ========================================================================= */
static void Error_Handler(void)
{
    __disable_irq();
    while (1)
    {
        HAL_GPIO_TogglePin(LED_PORT, LED_PIN);
        for (volatile uint32_t i = 0; i < 500000; i++);
    }
}

/* =========================================================================
 * Banner informasi program
 * ========================================================================= */
static void vPrintBanner(void)
{
    printf("\r\n");
    printf("=========================================================\r\n");
    printf(" STM32 FreeRTOS - Task Watchdog (IWDG)\r\n");
    printf(" Program 09: Independent Watchdog dengan Multi-Task\r\n");
    printf("=========================================================\r\n");
    printf(" Target : STM32F103C8 (Blue Pill) @ 72MHz\r\n");
    printf(" RTOS   : FreeRTOS (Preemptive Scheduler)\r\n");
    printf(" IWDG   : Independent Watchdog Timer\r\n");
    printf("---------------------------------------------------------\r\n");
    printf(" Konfigurasi Task:\r\n");
    printf("   FeederTask  : Prioritas %d - Me-refresh IWDG\r\n",
           FEEDER_TASK_PRIORITY);
    printf("   WorkerTask  : Prioritas %d - Kerja normal\r\n",
           WORKER_TASK_PRIORITY);
    printf("   ProblemTask : Prioritas %d - Akan hang\r\n",
           PROBLEM_TASK_PRIORITY);
    printf("   MonitorTask : Prioritas %d - Monitoring\r\n",
           MONITOR_TASK_PRIORITY);
    printf("---------------------------------------------------------\r\n");
    printf(" Skenario:\r\n");
    printf("   1. Semua task berjalan normal\r\n");
    printf("   2. FeederTask me-refresh IWDG setiap %d ms\r\n",
           IWDG_FEED_INTERVAL_MS);
    printf("   3. ProblemTask hang setelah %d siklus\r\n", PROBLEM_HANG_AFTER);
    printf("   4. FeederTask berhenti setelah %d siklus\r\n", FEEDER_STOP_AFTER);
    printf("   5. IWDG tidak di-refresh -> SYSTEM RESET!\r\n");
    printf("   6. Setelah reset, deteksi alasan via RCC flags\r\n");
    printf("=========================================================\r\n");
    printf("[DATA] INIT,feed_interval=%d,timeout=%d,hang_after=%d,stop_after=%d\r\n",
           IWDG_FEED_INTERVAL_MS, IWDG_TIMEOUT_MS,
           PROBLEM_HANG_AFTER, FEEDER_STOP_AFTER);
    printf("\r\n");
}

/* =========================================================================
 * Cetak konfigurasi IWDG
 * ========================================================================= */
static void vPrintIWDGConfig(void)
{
    printf("\r\n");
    printf("----- Konfigurasi IWDG -----\r\n");
    printf("  LSI Clock    : ~40 kHz (internal RC)\r\n");
    printf("  Prescaler    : /256\r\n");
    printf("  Counter Clock: ~156.25 Hz\r\n");
    printf("  Reload Value : %d\r\n", IWDG_RELOAD_VALUE);
    printf("  Timeout      : ~%.1f detik\r\n",
           (float)IWDG_RELOAD_VALUE / (40000.0f / 256.0f));
    printf("  Feed Interval: %d ms\r\n", IWDG_FEED_INTERVAL_MS);
    printf("  Safety Margin: ~%.1f detik\r\n",
           ((float)IWDG_RELOAD_VALUE / (40000.0f / 256.0f))
           - ((float)IWDG_FEED_INTERVAL_MS / 1000.0f));
    printf("\r\n");
    printf("  CATATAN: LSI tidak akurat (30-60 kHz)\r\n");
    printf("  Timeout sebenarnya bisa bervariasi!\r\n");
    printf("----------------------------\r\n");
    printf("[DATA] IWDG_CONFIG,prescaler=256,reload=%d,timeout_ms=%d\r\n",
           IWDG_RELOAD_VALUE, IWDG_TIMEOUT_MS);
    printf("\r\n");
}

/* =========================================================================
 * Cetak countdown menuju reset yang diharapkan
 * ========================================================================= */
static void vPrintCountdown(uint32_t ulRemainingMs)
{
    printf("  >>> COUNTDOWN: ~%lu.%lu detik sampai IWDG RESET <<<\r\n",
           (unsigned long)(ulRemainingMs / 1000),
           (unsigned long)((ulRemainingMs % 1000) / 100));
    printf("[DATA] COUNTDOWN,remaining_ms=%lu,tick=%lu\r\n",
           (unsigned long)ulRemainingMs,
           (unsigned long)xTaskGetTickCount());
}

/* =========================================================================
 * Watchdog Feeder Task
 * Secara periodik memanggil HAL_IWDG_Refresh() untuk me-reset counter IWDG
 * Berhenti setelah FEEDER_STOP_AFTER siklus untuk mendemonstrasikan reset
 * ========================================================================= */
static void vWatchdogFeederTask(void *pvParameters)
{
    (void)pvParameters;
    TickType_t xLastWakeTime = xTaskGetTickCount();

