rofiqcp/Praktikum-Sistem-Embedded/Modul-06-FreeRTOS-Task/praktikum/STM32/STM32_09_Task_Watchdog/src/main.c
    printf("[FeederTask] Dimulai - Interval: %d ms\r\n", IWDG_FEED_INTERVAL_MS);
    printf("[FeederTask] Akan berhenti setelah %d siklus\r\n", FEEDER_STOP_AFTER);

    for (;;)
    {
        if (ucFeederActive)
        {
            ulFeedCount++;
            ulLastFeedTick = xTaskGetTickCount();

            /* Refresh IWDG - reset counter ke nilai reload */
            HAL_IWDG_Refresh(&hiwdg);

            /* LED toggle sebagai heartbeat */
            HAL_GPIO_TogglePin(LED_PORT, LED_PIN);

            printf("[FeederTask] IWDG refresh #%lu (tick=%lu)\r\n",
                   (unsigned long)ulFeedCount,
                   (unsigned long)ulLastFeedTick);

            printf("[DATA] FEED,count=%lu,tick=%lu,active=1\r\n",
                   (unsigned long)ulFeedCount,
                   (unsigned long)ulLastFeedTick);

            /* Cek apakah sudah waktunya berhenti */
            if (ulFeedCount >= FEEDER_STOP_AFTER)
            {
                ucFeederActive = 0;
                ulExpectedResetTick = xTaskGetTickCount() + IWDG_TIMEOUT_MS;

                printf("\r\n");
                printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\r\n");
                printf("!! FEEDER BERHENTI!                    !!\r\n");
                printf("!! IWDG tidak akan di-refresh lagi!    !!\r\n");
                printf("!! System reset dalam ~%d detik!       !!\r\n",
                       IWDG_TIMEOUT_MS / 1000);
                printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\r\n");
                printf("[DATA] FEEDER_STOPPED,feed_count=%lu,tick=%lu\r\n",
                       (unsigned long)ulFeedCount,
                       (unsigned long)xTaskGetTickCount());
                printf("[DATA] EXPECTED_RESET,tick=%lu\r\n",
                       (unsigned long)ulExpectedResetTick);
            }
        }
        else
        {
            /* Feeder tidak aktif - hitung mundur ke reset */
            uint32_t ulNow = xTaskGetTickCount();
            uint32_t ulSinceLastFeed = ulNow - ulLastFeedTick;

            if (ulSinceLastFeed < IWDG_TIMEOUT_MS)
            {
                uint32_t ulRemaining = IWDG_TIMEOUT_MS - ulSinceLastFeed;
                vPrintCountdown(ulRemaining);
            }
            else
            {
                printf("[FeederTask] IWDG seharusnya sudah reset!\r\n");
                printf("[FeederTask] (LSI tidak akurat, mungkin sedikit lebih lama)\r\n");
                printf("[DATA] RESET_OVERDUE,elapsed=%lu,tick=%lu\r\n",
                       (unsigned long)ulSinceLastFeed,
                       (unsigned long)ulNow);
            }

            /* LED pattern error: kedip cepat */
            for (int i = 0; i < 5; i++)
            {
                HAL_GPIO_TogglePin(LED_PORT, LED_PIN);
                vTaskDelay(pdMS_TO_TICKS(50));
            }
        }

        vTaskDelayUntil(&xLastWakeTime, pdMS_TO_TICKS(IWDG_FEED_INTERVAL_MS));
    }
}

/* =========================================================================
 * Normal Worker Task
 * Task yang bekerja normal dan tidak berinteraksi dengan watchdog
 * ========================================================================= */
static void vNormalWorkerTask(void *pvParameters)
{
    (void)pvParameters;
    TickType_t xLastWakeTime = xTaskGetTickCount();

    printf("[WorkerTask] Dimulai - Task kerja normal\r\n");

    for (;;)
    {
        ulWorkerCounter++;

        /* Simulasi kerja normal */
        volatile uint32_t ulResult = 0;
        for (volatile uint32_t i = 0; i < 1000; i++)
        {
            ulResult += i * ulWorkerCounter;
        }

        /* Cetak status periodik */
        if (ulWorkerCounter % 5 == 0)
        {
            printf("[WorkerTask] Siklus %lu, hasil=%lu (tick=%lu)\r\n",
                   (unsigned long)ulWorkerCounter,
                   (unsigned long)ulResult,
                   (unsigned long)xTaskGetTickCount());

            printf("[DATA] WORKER,cycle=%lu,result=%lu,tick=%lu\r\n",
                   (unsigned long)ulWorkerCounter,
                   (unsigned long)ulResult,
                   (unsigned long)xTaskGetTickCount());
        }

        /* Cek status feeder */
        if (!ucFeederActive)
        {
            printf("[WorkerTask] PERINGATAN: Feeder tidak aktif! "
                   "Reset akan segera terjadi!\r\n");
        }

        vTaskDelayUntil(&xLastWakeTime, pdMS_TO_TICKS(800));
    }
}

/* =========================================================================
 * Problematic Task
 * Task yang sengaja hang setelah beberapa siklus
 * Mendemonstrasikan apa yang terjadi jika satu task freeze
 * ========================================================================= */
static void vProblematicTask(void *pvParameters)
{
    (void)pvParameters;
    TickType_t xLastWakeTime = xTaskGetTickCount();

    printf("[ProblemTask] Dimulai - Akan hang setelah %d siklus\r\n",
           PROBLEM_HANG_AFTER);

    for (;;)
    {
        ulProblemCounter++;

        if (ulProblemCounter <= PROBLEM_HANG_AFTER)
        {
            /* Operasi normal */
            volatile uint32_t ulWork = 0;
            for (volatile uint32_t i = 0; i < 500; i++)
            {
                ulWork += i;
            }

            uint32_t ulRemaining = PROBLEM_HANG_AFTER - ulProblemCounter;

            printf("[ProblemTask] Siklus %lu/%d (sisa %lu sebelum hang)\r\n",
                   (unsigned long)ulProblemCounter,
                   PROBLEM_HANG_AFTER,
                   (unsigned long)ulRemaining);

            printf("[DATA] PROBLEM,cycle=%lu,remaining=%lu,status=normal,tick=%lu\r\n",
                   (unsigned long)ulProblemCounter,
                   (unsigned long)ulRemaining,
                   (unsigned long)xTaskGetTickCount());

            /* Peringatan mendekati hang */
            if (ulRemaining <= 3)
            {
                printf("[ProblemTask] >>> PERINGATAN: %lu siklus lagi sebelum HANG! <<<\r\n",
                       (unsigned long)ulRemaining);
            }
        }
        else
        {
            /* HANG! Masuk infinite loop */
            if (!ucProblemHanging)
            {
                ucProblemHanging = 1;

                printf("\r\n");
                printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\r\n");
                printf("!! PROBLEM TASK HANG!                  !!\r\n");
                printf("!! Task masuk infinite loop!           !!\r\n");
                printf("!! Dalam sistem nyata, ini bisa karena:!!\r\n");
                printf("!!   - Deadlock                        !!\r\n");
                printf("!!   - Bug infinite loop               !!\r\n");
                printf("!!   - Menunggu resource yang tidak ada !!\r\n");
                printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\r\n");
                printf("[DATA] PROBLEM_HANG,cycle=%lu,tick=%lu\r\n",
                       (unsigned long)ulProblemCounter,
                       (unsigned long)xTaskGetTickCount());
            }

            /* Infinite loop - task ini tidak akan pernah keluar */
            /* CATATAN: Ini TIDAK langsung menyebabkan IWDG reset
             * karena feeder task masih berjalan di task terpisah.
             * IWDG hanya reset jika FEEDER juga berhenti. */
            while (1)
            {
                /* Stuck - tapi task lain masih bisa berjalan
                 * karena preemptive scheduler */
                __NOP();
                /* Busy loop tanpa delay - akan menggunakan CPU
                 * tapi scheduler akan preempt untuk task lain */
                volatile uint32_t ulDummy = 0;
                for (volatile uint32_t i = 0; i < 100000; i++)
                {
                    ulDummy++;
                }
                taskYIELD(); /* Beri kesempatan task lain */
            }
        }

        vTaskDelayUntil(&xLastWakeTime, pdMS_TO_TICKS(PROBLEM_TASK_DELAY_MS));
    }
}

/* =========================================================================
 * Monitor Task
 * Memantau status keseluruhan sistem dan mencetak laporan
 * ========================================================================= */
static void vMonitorTask(void *pvParameters)
{
    (void)pvParameters;
    TickType_t xLastWakeTime = xTaskGetTickCount();

    printf("[MonitorTask] Dimulai - Monitoring sistem\r\n");

    for (;;)
    {
        ulMonitorCycle++;

        printf("\r\n");
        printf("----- Monitor Siklus %lu (tick=%lu) -----\r\n",
               (unsigned long)ulMonitorCycle,
               (unsigned long)xTaskGetTickCount());

