rofiqcp/Praktikum-Sistem-Embedded/Modul-06-FreeRTOS-Task/praktikum/STM32/STM32_09_Task_Watchdog/src/main.c
        /* Status IWDG */
        printf("  IWDG Feed Count : %lu\r\n", (unsigned long)ulFeedCount);
        printf("  IWDG Feeder     : %s\r\n",
               ucFeederActive ? "AKTIF" : "BERHENTI!");
        printf("  Last Feed Tick  : %lu\r\n", (unsigned long)ulLastFeedTick);

        /* Waktu sejak feed terakhir */
        uint32_t ulSinceLastFeed = xTaskGetTickCount() - ulLastFeedTick;
        printf("  Sejak feed akhir: %lu ms\r\n", (unsigned long)ulSinceLastFeed);

        /* Status task */
        printf("  Worker Counter  : %lu\r\n", (unsigned long)ulWorkerCounter);
        printf("  Problem Counter : %lu\r\n", (unsigned long)ulProblemCounter);
        printf("  Problem Status  : %s\r\n",
               ucProblemHanging ? "HANG!" : "Normal");

        /* IWDG reset detected */
        if (ucIWDGResetDetected)
        {
            printf("  >>> IWDG Reset terdeteksi dari boot sebelumnya!\r\n");
        }

        /* Free heap */
        printf("  Free Heap       : %lu bytes\r\n",
               (unsigned long)xPortGetFreeHeapSize());

        /* Health check bar */
        printf("  Kesehatan Sistem: ");
        if (ucFeederActive && !ucProblemHanging)
        {
            printf("[################....] BAIK\r\n");
        }
        else if (ucFeederActive && ucProblemHanging)
        {
            printf("[########............] PERINGATAN\r\n");
        }
        else if (!ucFeederActive && !ucProblemHanging)
        {
            printf("[####................] BURUK\r\n");
        }
        else
        {
            printf("[....................] KRITIS!\r\n");
        }

        /* Data terstruktur */
        printf("[DATA] MONITOR,cycle=%lu,feeds=%lu,feeder=%d,problem=%d,"
               "worker=%lu,since_feed=%lu,tick=%lu\r\n",
               (unsigned long)ulMonitorCycle,
               (unsigned long)ulFeedCount,
               ucFeederActive,
               ucProblemHanging,
               (unsigned long)ulWorkerCounter,
               (unsigned long)ulSinceLastFeed,
               (unsigned long)xTaskGetTickCount());

        /* Countdown jika feeder berhenti */
        if (!ucFeederActive)
        {
            if (ulSinceLastFeed < IWDG_TIMEOUT_MS)
            {
                vPrintCountdown(IWDG_TIMEOUT_MS - ulSinceLastFeed);
            }
            else
            {
                printf("  >>> IWDG RESET seharusnya sudah terjadi! <<<\r\n");
            }
        }

        /* Panduan arsitektur watchdog di multi-task */
        if (ulMonitorCycle == 3)
        {
            printf("\r\n");
            printf("=========================================================\r\n");
            printf(" PANDUAN: Arsitektur Watchdog di Sistem Multi-Task\r\n");
            printf("=========================================================\r\n");
            printf(" Pola 1: Single Feeder (yang digunakan di sini)\r\n");
            printf("   - Satu task khusus untuk feed IWDG\r\n");
            printf("   - Sederhana tapi tidak mendeteksi task hang\r\n");
            printf("   - Kecuali feeder sendiri yang hang\r\n");
            printf("\r\n");
            printf(" Pola 2: Cooperative Watchdog (lebih baik)\r\n");
            printf("   - Setiap task mengirim 'check-in' ke monitor\r\n");
            printf("   - Monitor hanya feed IWDG jika SEMUA task\r\n");
            printf("     sudah check-in dalam interval yang ditentukan\r\n");
            printf("   - Jika satu task hang -> tidak ada feed -> reset\r\n");
            printf("\r\n");
            printf(" Pola 3: Task Watchdog Timer (FreeRTOS Timer)\r\n");
            printf("   - Gunakan software timer untuk timeout per-task\r\n");
            printf("   - Timer di-reset setiap task menyelesaikan siklus\r\n");
            printf("   - Timeout = task hang -> aksi recovery\r\n");
            printf("=========================================================\r\n");
            printf("[DATA] GUIDE_PRINTED,tick=%lu\r\n",
                   (unsigned long)xTaskGetTickCount());
        }

        vTaskDelayUntil(&xLastWakeTime, pdMS_TO_TICKS(2000));
    }
}

/* =========================================================================
 * HAL MSP Init - Dipanggil oleh HAL_Init()
 * ========================================================================= */
void HAL_MspInit(void) {
#if defined(STM32F103xB)
    __HAL_RCC_AFIO_CLK_ENABLE();
    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_AFIO_REMAP_SWJ_NOJTAG();
#elif defined(STM32F401xC) || defined(STM32F411xE)
    __HAL_RCC_PWR_CLK_ENABLE();
#else
    __HAL_RCC_PWR_CLK_ENABLE();
#endif
}

/* =========================================================================
 * MAIN - Entry Point
 * ========================================================================= */
int main(void)
{
    /* Inisialisasi HAL */
    HAL_Init();

    /* Konfigurasi System Clock: HSE 8MHz -> PLL -> 72MHz */
    SystemClock_Config();

    /* Inisialisasi peripheral */
    GPIO_Init();
    UART1_Init();

    /* Cek alasan reset SEBELUM clear flags */
    eResetReason = eCheckResetReason();

    /* Banner */
    vPrintBanner();

    /* Cetak informasi reset */
    vPrintResetInfo(eResetReason);

    /* Jika ini boot setelah IWDG reset, tampilkan analisis */
    if (eResetReason == RESET_IWDG)
    {
        printf("=========================================================\r\n");
        printf(" ANALISIS POST-RESET\r\n");
        printf("=========================================================\r\n");
        printf(" Sistem di-reset oleh IWDG (watchdog)!\r\n");
        printf(" Kemungkinan penyebab:\r\n");
        printf("   - Task feeder berhenti/hang\r\n");
        printf("   - Sistem terlalu sibuk (CPU overload)\r\n");
        printf("   - Bug menyebabkan task feeder tidak berjalan\r\n");
        printf("   - Stack overflow merusak task feeder\r\n");
        printf("\r\n");
        printf(" Tindakan yang bisa diambil:\r\n");
        printf("   - Log error ke Flash/EEPROM sebelum reset\r\n");
        printf("   - Masuk mode safe/recovery\r\n");
        printf("   - Kirim notifikasi error\r\n");
        printf("=========================================================\r\n");
        printf("[DATA] POST_RESET_ANALYSIS,reason=IWDG\r\n");
        printf("\r\n");
    }

    /* Cetak konfigurasi IWDG */
    vPrintIWDGConfig();

    /* Inisialisasi IWDG */
    printf("[INFO] Menginisialisasi IWDG...\r\n");
    IWDG_Init();

    /* Buat task */
    BaseType_t xResult;

    xResult = xTaskCreate(vWatchdogFeederTask, "Feeder",
                          FEEDER_STACK_SIZE, NULL,
                          FEEDER_TASK_PRIORITY, &xFeederTaskHandle);
    if (xResult != pdPASS) { printf("[ERROR] Gagal membuat FeederTask!\r\n"); Error_Handler(); }

    xResult = xTaskCreate(vNormalWorkerTask, "Worker",
                          WORKER_STACK_SIZE, NULL,
                          WORKER_TASK_PRIORITY, &xWorkerTaskHandle);
    if (xResult != pdPASS) { printf("[ERROR] Gagal membuat WorkerTask!\r\n"); Error_Handler(); }

    xResult = xTaskCreate(vProblematicTask, "ProblemTask",
                          PROBLEM_STACK_SIZE, NULL,
                          PROBLEM_TASK_PRIORITY, &xProblemTaskHandle);
    if (xResult != pdPASS) { printf("[ERROR] Gagal membuat ProblemTask!\r\n"); Error_Handler(); }

    xResult = xTaskCreate(vMonitorTask, "Monitor",
                          MONITOR_STACK_SIZE, NULL,
                          MONITOR_TASK_PRIORITY, &xMonitorTaskHandle);
    if (xResult != pdPASS) { printf("[ERROR] Gagal membuat MonitorTask!\r\n"); Error_Handler(); }

    printf("[INFO] Semua task berhasil dibuat\r\n");
    printf("[INFO] Free Heap: %lu bytes\r\n",
           (unsigned long)xPortGetFreeHeapSize());
    printf("[INFO] IWDG aktif - timeout ~%d detik\r\n", IWDG_TIMEOUT_MS / 1000);
    printf("[INFO] Memulai scheduler...\r\n\r\n");

    /* Mulai scheduler */
    vTaskStartScheduler();

    /* Seharusnya tidak pernah sampai sini */
    printf("[ERROR] Scheduler berhenti!\r\n");
    for (;;);
}
